#建立中轉英DB
product_class_dict = {'彩妝': 'makeup', '保養': 'cosmetic', '清潔': 'clean', '工具': 'tool', '香水': 'perfume'}

subclass_class = {'隔離乳': '彩妝', '遮瑕膏': '彩妝', '粉底液': '彩妝', '散粉': '彩妝', '眼影': '彩妝',
                  '眉粉': '彩妝', '唇膏': '彩妝', '唇釉': '彩妝', '護唇膏': '彩妝',
                  '唇露': '彩妝', 'BC_霜': '彩妝', '氣墊粉餅': '彩妝',
                  '眼線液': '彩妝', '睫毛膏': '彩妝', '唇蜜': '彩妝', '腮紅': '彩妝', '指彩': '彩妝', '前導液': '保養',
                  '唇保養': '保養',
                  '化妝水': '保養', '精華液': '保養', '乳液霜/凝凍': '保養', '面膜': '保養', '平衡油': '保養',
                  '眼部精華': '保養', '眼霜': '保養', '眼膜': '保養', '護手霜': '保養',
                  '洗髮精': '清潔', '洗面乳': '清潔', '洗面皂': '清潔', '沐浴乳': '清潔',
                  '眼卸妝': '清潔', '面卸妝': '清潔', '去甲油': '清潔',
                  '粉刷': '工具', '粉撲': '工具', '海綿撲': '工具', '眉刷': '工具',
                  '睫毛夾': '工具', '眼影刷': '工具', '胭脂掃': '工具', '香水': '香水', '香精': '香水'}

